{
    "podcast_name": "Creativity Boosters",
    "podcast_publisher": "Creativity Boosters",
    "podcast_description": "**Stop letting others steal the spotlight with 'better ideas.'** Creativity isn't a magical gift; it's a skill you can build. *Creativity Boosters* is your weekly toolkit for decoding innovation and applying it to real-world business challenges. Hosts Dinko and Nikhil cut through the academic fluff to bring you: *   🚀 **Actionable Frameworks** to generate winning ideas on demand. *   🧠 **Applied Innovation Theory** that actually works in corporate settings. *   🎙️ **Expert Interviews** with industry leaders who walk the talk. Whether you want to lead your team, disrupt your market, or just be the smartest person in the room, this is where you learn how. **Subscribe now and start building your creative advantage.**",
    "spotify_url": "https://open.spotify.com/show/5LZ5ra5zWRAIUB9JzFCre7",
    "total_episodes": 29,
    "episodes": [
        {
            "title": "Is China dominating Innovation? | Creativity Boosters Episode 29",
            "description": "Join hosts Dinko and Nikhil on Creativity Boosters, the podcast that dives into the heart of innovation and creativity in today’s fast-paced business world. In this episode, we explore whether China is emerging as the global powerhouse of innovation. From massive R&D investments surpassing $500 billion annually to leading in AI, 5G, electric vehicles, and fintech, China is reshaping the innovation landscape. But is it genuine leadership or strategic replication at scale? We debate the myths and realities of China’s innovation model, from state-driven initiatives to private-sector breakthroughs, and examine how global standards, cultural shifts, and reverse brain drain are positioning China for the future. Tune in for a nuanced discussion on what it means to be an innovation hub in 2025, and walk away with fresh perspectives on creativity, competition, and the forces driving the next generation of technology. Subscribe, rate, and share to keep your creativity boosted!   Time stamps: 00:00 The Rise of China's Innovation Landscape 02:42 Shifting Perspectives on Innovation 06:22 The Role of Government and Private Sector 09:57 Education and the New Generation of Innovators 13:09 Quality vs. Quantity in Innovation 16:41 The Impact of Subsidies on Innovation 19:36 China's Manufacturing Dominance and Global Supply Chains 25:09 China's Influence on Global Standards 26:30 China's Dominance in Green Energy 28:43 The 996 Work Culture and Its Implications 30:16 Cultural Perspectives on Pressure and Resilience 32:12 India's Rise as an Innovation Hub 33:56 Shifts in Innovation Paradigms 35:12 China's Demographic Challenges 36:21 The Future of China's Workforce 38:38 Education Reforms and Creativity 42:22 Measuring Innovation in a Global Context 43:33 Work-Life Balance vs. Competitiveness 46:16 Reflections on Future Innovation Hubs",
            "release_date": "2025-07-31",
            "duration_minutes": 49.41,
            "spotify_url": "https://open.spotify.com/episode/1MB9ARmft3TprnmA4cmCPo",
            "id": "1MB9ARmft3TprnmA4cmCPo"
        },
        {
            "title": "Balancing Logic and Imagination: Unleashing High IQ and High CQ in Everyday Business | Creativity Boosters Episode 28",
            "description": "Curious about making your ideas not just smart, but irresistible? This episode uncovers the secrets to balancing high IQ logic with high CQ creativity in everyday business scenarios. Discover practical strategies to enhance your team's innovation, make meetings more engaging, and transform routine tasks into opportunities for innovation.  Whether you're a manager aiming to inspire your team or an individual looking to boost your creative edge, this episode offers actionable insights to improve your approach and drive real results. Join us and let's boost your creativity together.  Takeaways - Creativity is essential for innovation in business. - Balancing logic and emotion is crucial for team dynamics. - Offsites should focus on experiential design and storytelling. - CQ (Creativity Coefficient) is as important as IQ. - Narratives make financial reports more engaging. - Budget cuts can be reframed as opportunities for creativity. - Diversity in teams enhances creative problem-solving. - Emotional attachment to ideas can hinder innovation. - Leaders should foster a culture of creativity and safety. - Hiring for both IQ and CQ is vital for success.  Chapters (00:16) Exploring Team Offsites and Their Effectiveness (01:13) Balancing High IQ and High CQ Thinking (02:06) The Importance of Engaging Hearts and Minds (03:37) Emotional Impact of Events (05:54) Understanding Creativity Coefficient (CQ) (08:06) The Role of High IQ vs High CQ in Offsites (10:18) Innovative Approaches to Offsite Planning (14:28) Quarterly Financial Presentations: Clarity vs Creativity (20:03) Navigating Budget Cuts: Optimization vs Opportunity Mining (26:58) Time Management and Creative Thinking in Organizations (33:00) Fostering a Culture of Creativity (37:23) The Need for Immigration and Diversity (38:53) High IQ vs. High CQ in Hiring (42:10) Creative Approaches to Product Development (45:50) Balancing Creativity and Structure in Management (47:51) Do's and Don'ts for Managing High CQ Individuals (53:44) Emotional Attachment to Ideas and Business Context (59:46) Final Thoughts on Creativity and Innovation",
            "release_date": "2025-07-12",
            "duration_minutes": 66.31,
            "spotify_url": "https://open.spotify.com/episode/2DP4zCW8dQECLdBGMHRiTf",
            "id": "2DP4zCW8dQECLdBGMHRiTf"
        },
        {
            "title": "The Creative Scorecard: Benchmarking U.S. Presidents on Innovation | Creativity Boosters Episode 27",
            "description": "What is the line between originality and unpredictability in leadership? Using Donald Trump's rhetoric as a focal point, we question whether his approach is a reflection of originality or a descent into chaos. Utilizing the Torrance Test of Creative Thinking, Dinko and Nikhil assess various dimensions such as fluency, originality, flexibility, and elaboration, benchmarking Trump against historical figures like Thomas Jefferson and Abraham Lincoln.  Our discussion reveals contrasting perspectives on Trump's approach to creativity and leadership, sparked a debate on the impact of presidential creativity on the American population. We invite you to tune in and decide for yourself if Trump's style signals brute innovation or just a whirlwind of unpredictability.   Chapters (00:00) Exploring Creativity in Leadership (03:08) Historical Perspectives on Presidential Creativity (05:58) The Torrance Test of Creative Thinking (08:59) Analyzing Donald Trump's Creativity (11:23) Dimensions of Creativity: Fluency and Originality (14:37) The Impact of Originality in Leadership (17:29) Contrasting Leadership Styles: Trump vs. FDR (20:39) The Role of Creativity in Political Solutions (26:25) Historical Context of Tariffs and Economic Consequences (29:00) Flexibility in Leadership: Lessons from Lincoln (31:59) Cognitive Flexibility: Trump’s Media Adaptation (35:10) Elaboration: The Need for Detailed Policy Plans (40:15) Assessing Creativity: Gains and Losses in Trump’s Approach (42:03) Improving Creativity: Suggestions for Trump (55:19) Final Thoughts: Evaluating Trump’s Creative Quotient",
            "release_date": "2025-06-21",
            "duration_minutes": 55.33,
            "spotify_url": "https://open.spotify.com/episode/66oirnXJJiRJjU5ITUSM3Y",
            "id": "66oirnXJJiRJjU5ITUSM3Y"
        },
        {
            "title": "From Struggle to Success: The UFC Story about Visionary Leadership in Action I Creativity Boosters Episode 26",
            "description": "This episode explores the incredible transformation of the UFC from a struggling organization to a global powerhouse, highlighting the visionary leadership of Dana White, the importance of risk-taking, strategic management, and emotional branding. The discussion delves into the role of storytelling in business, the necessity of change management, and the impact of digital transformation on the UFC's growth. Listeners will gain actionable insights into how these principles can be applied in their own professional journeys.  Takeaways: - The UFC's transformation is a case study in visionary leadership. - Risk-taking is essential for innovation and growth. - Strategic management involves leveraging intellectual property effectively. - Emotional branding creates strong connections with audiences. - Change management is crucial for implementing new strategies. - Incremental and radical innovations can coexist in an organization. - Effective storytelling enhances project proposals and engagement. - Digital transformation requires overcoming resistance to change. - Building a culture of innovation involves continuous feedback and adaptation. - Authentic leadership is key to navigating challenges and driving change.  Chapters: 00:00 Introduction to Creativity and Innovation 01:18 Risk-Taking and Visionary Leadership in UFC 06:39 Strategic Management and Control of Intellectual Property 14:49 Overcoming Skepticism and Building Credibility 24:58 Innovative Strategies: The Ultimate Fighter Reality Show 32:02 The Birth of the Octagon 35:26 Get Fired Ideas: Embracing Creativity 37:53 Incremental vs. Radical Innovation 41:02 Emotional Branding and Storytelling 47:31 Digital Transformation and Change Management 51:32 Navigating Resistance to Change 59:53 The Change Management Model 01:04:47 Visionary Leadership and Authenticity",
            "release_date": "2025-06-07",
            "duration_minutes": 67.98,
            "spotify_url": "https://open.spotify.com/episode/6DpWFEiD2VDq8TFIFpOxw7",
            "id": "6DpWFEiD2VDq8TFIFpOxw7"
        },
        {
            "title": "Uncharted: Innovation in Uncertain Times - Surviving VUCA through bold innovation | Creativity Boosters Episode 25",
            "description": "In a world defined by Volatility, Uncertainty, Complexity, and Ambiguity, how do the most resilient minds lead, adapt, and create? VUCA & Visionaries dives deep into the strategies, stories, and mindsets that fuel innovation in unpredictable times. Each episode unpacks how real-world leaders—from global businesses to grassroots ventures—harness creativity to not just survive, but thrive in today’s rapidly shifting landscape.  With insights from experts, quotes from thought leaders like McKinsey, HBR, and BCG, and inspiring case studies beyond the usual tech suspects, this podcast is your go-to guide for building agility, resilience, and bold thinking in a complex world. Whether you're a team leader, strategist, or change-maker, VUCA & Visionaries gives you the tools and inspiration to navigate chaos with confidence.",
            "release_date": "2025-05-14",
            "duration_minutes": 72.1,
            "spotify_url": "https://open.spotify.com/episode/0tv65Mg398q00sSPKwzhEb",
            "id": "0tv65Mg398q00sSPKwzhEb"
        },
        {
            "title": "Rethinking Resources: Embracing Frugal Innovation for Sustainable Solutions | Creativity Boosters Episode 24",
            "description": "Boosters! Explore the concept of frugal innovation and understand how constraints can drive creativity and lead to groundbreaking solutions.  In this episode learn from real-world examples across various sectors, including education and mobile banking, highlighting the importance of user-centered design and cultural adaptation. Learn about the significance of cross-functional collaboration and the need to challenge invisible rules that limit innovation. Practical exercises and lessons for organizations are provided to encourage a mindset shift towards frugal innovation.  Toolkit for Implementation: 1. Resource Reduction Challenge: Redesign a process or product with limited resources. 2. Conversation Starter: Discuss clever workarounds within your team to highlight frugal innovation principles. 3. Metric Shift: Calculate the resource-to-value ratio for projects to incentivize frugal innovation.  Chapters (00:00) Introduction to Frugal Innovation (02:38) Power of Constraints in Innovation (09:45) Frugal Innovation: Definitions and Principles (11:43) Cost Reduction and Core Functionalities (17:55) Cultural Influences on Innovation (25:25) Nollywood: A Case of Creative Capacity (32:20) BRAC Schools: Education Innovation in Bangladesh (40:18) Africa's Mobile Banking Revolution (46:38) Constraints as Catalysts (53:38) Frugal Innovation: Constraints as Catalysts (continued) (59:00) Learning from Global Innovations (01:03:25) Practical Tools for Frugal Innovation",
            "release_date": "2025-04-07",
            "duration_minutes": 69.95,
            "spotify_url": "https://open.spotify.com/episode/3EvQUFI329f45LItzT1TeG",
            "id": "3EvQUFI329f45LItzT1TeG"
        },
        {
            "title": "From Perfectionism to Play: Embracing Creativity with Melissa Dinwiddie | Creativity Boosters Episode 23",
            "description": "In this episode of Creativity Boosters engage with Melissa Dinwiddie, a creative catalyst, discussing the essence of creativity and innovation. They explore how societal structures, particularly education, can stifle creativity and the importance of play in fostering a creative mindset.  Melissa shares her insights on overcoming perfectionism, the significance of self-compassion, and practical exercises to enhance creativity.  The conversation emphasizes the interconnectedness of creativity across various domains and the necessity of empathetic communication in collaborative environments. Ultimately, they highlight the importance of embracing imperfection and the power of the yes-and mindset in driving innovation.  Gift for Creativity Boosters and other links: A gift from Melissa (bit.ly/cbthankyou)  Melissa Dinwiddy https://melissadinwiddy.com  The Creative Sandbox https://melissadinwiddy.com/books  Dr. Kristen Neff https://self-compassion.org  LEGO Serious Play https://www.lego.com/en-us/seriousplay  Timestamps (02:23) Defining Creativity and Innovation (05:16) Creativity as an Organizational Imperative (06:16) Creativity as a Birthright (13:23) Preserving Childhood Creativity (15:51) Education and Creative Expression (18:25) Structure as a Catalyst for Innovation (20:28) Self-Compassion and Creative Courage (28:50) Cultivating Continuous Self-Compassion (31:50) Creating the Impossible Framework (40:38) Communication and Collective Creativity (47:57) Decoding Creativity Scars (51:53) Silicon Valley's Creative Ecosystem (55:19) Improvisation as Creative Practice (57:55) Interconnected Creative Pursuits (01:00:18) Creative Invitations (01:03:06) Humanity's Most Transformative Invention (01:05:22) Creativity Jam: Guitar and Microphone (01:08:00) Action Against Creative Despair",
            "release_date": "2025-03-27",
            "duration_minutes": 72.12,
            "spotify_url": "https://open.spotify.com/episode/0Q8MXrQUgVgHPJm2FObZKl",
            "id": "0Q8MXrQUgVgHPJm2FObZKl"
        },
        {
            "title": "What you can learn from Amazon's PRFAQ innovation method: Interview with Marcelo Calbucci | Creativity Boosters Episode 22",
            "description": "Dive into the magic of true corporate intrepreneurship combined with actual true entrepreneurial key takeaways. Marcelo Calbucci is one of a kind when it comes to experience within the realm of these topics with a list of multiple start-ups and patents in his name. In this episode, the talk about what working in Microsoft and Amazon can tell you about how to innovate and more specifically, we dive into the backbone of Amazon's innovation method - The PRFAQ method, which is a proven technique to ignite ideas for new business models and products.   Links: The book behind the method: https://www.theprfaq.com",
            "release_date": "2025-03-07",
            "duration_minutes": 101.36,
            "spotify_url": "https://open.spotify.com/episode/3pD2hakw9O8YyQSFdNldvY",
            "id": "3pD2hakw9O8YyQSFdNldvY"
        },
        {
            "title": "From Hollywood Scripts to Netflix Hits: Adam Tex Davis Talks Creativity & Leonardo DiCaprio | Creativity Boosters Episode 21",
            "description": "Dive into the world of Hollywood creativity with our special guest, Adam Tex Davis, an Emmy-nominated writer-producer whose career is a testament to adaptability and innovation. From selling his first screenplay to Harvey Weinstein to crafting cult classics like \"Just Friends,\" Adam's journey is filled with intriguing stories and creative insights. Discover how he collaborates with industry giants like Leonardo DiCaprio and Pharrell Williams, and learn his strategies for idea generation, problem-solving, and thriving under tight deadlines The conversation delves into defining creativity, the iterative process of writing, and the balance between creative freedom and commercial viability. Adam also shares unexpected experiences from his career, emphasizing the significance of teamwork and the value of feedback in the creative process  Takeaways - Creativity is about making something from nothing. - Never talk down to your audience; engage them at a higher level. - The more you do something, the better you get at it. - Best idea wins; collaboration is key. - Always write down your ideas; you won't remember them later. - The act of writing is often more about rewriting. - You can have the right project at the wrong place. - Pick your battles wisely in creative discussions. - Different takes can lead to unexpected brilliance. - Not every project needs to be overly complex; simplicity can be powerful. Networking can lead to unexpected opportunities. - Working with established talent can elevate a project. - Specialization can enhance your career in the creative industry. - AI can be a useful tool, but human creativity is irreplaceable. - Avoiding burnout is crucial for long-term creativity. - Diversity in creative skills can lead to more opportunities. - Creative projects can evolve through collaboration.  Links Adam's Company: https://www.atomicentertainment.com/ Adam's Podcast \"Who Smarted?\": https://whosmarted.com/  Timestamp (00:00) Introduction to Creativity and Innovation (02:53) Adam Tex Davis: A Creative Journey in Hollywood (06:55) Defining Creativity: The Essence of Creation (10:55) Iterative Process of Writing and Rewriting (15:41) Navigating Creative Differences in Hollywood (20:02) Collaboration and Finding the Right Partners (29:37) Working with Spouses and Friends (34:42) Building Creative Relationships (36:46) Fostering Collaborative Creativity (38:42) Navigating Team Dynamics (41:34) Art of Feedback (44:21) Engaging the Audience (47:07) Finding the Right Talent (49:43) Balancing Creativity and Commercial Viability (52:18) The Role of Directors in Creativity (55:01) Pitching Ideas and Managing Expectations (57:54) Unexpected Experiences in Filmmaking (01:12:40) Working with Leonardo DiCaprio (01:15:30) The Nature of Talent in Hollywood (01:18:36) Versatility and Creative Pivots (01:25:55) AI in Creative Writing (01:33:00) Sustaining Creative Output (01:36:40) Creativity Jam: Penguin Terminator (01:40:25) The Impact of the Internet on Creativity (01:47:51) - Creative Projects That Excite Adam Tex Davis",
            "release_date": "2024-12-13",
            "duration_minutes": 114.44,
            "spotify_url": "https://open.spotify.com/episode/5boZhoorczfd7eOa4QAMEs",
            "id": "5boZhoorczfd7eOa4QAMEs"
        },
        {
            "title": "From Light Bulbs to Algorithms: How AI Sparks Creativity | Creativity Boosters Episode 20",
            "description": "What if AI could be as transformative as electricity was to the industrial revolution? Drawing powerful parallels between today's AI revolution and history-changing inventions like the light bulb and telephone, they reveal how AI isn't just another tool—it's a platform that could reshape how we create and innovate. Through fascinating stories of Edison, Otto, and Bell, discover why some innovations changed the world while others fell flat, and learn what these historical lessons mean for your AI journey today.  From cultivating an AI-curious mindset to building effective cross-functional teams, get actionable insights to position your organization at the forefront of the AI revolution. Whether you're an innovation leader, entrepreneur, or creative professional, this episode offers a fresh perspective on AI's transformative potential while honestly addressing its ethical challenges. Join us to unlock the secrets of AI-driven innovation and learn how to harness this powerful platform for your creative endeavors.  Time stamp (00:00) - Beyond AI Applications: The Platform Perspective (05:12) - Historical Innovation Stories (17:55) - Ethical Considerations in AI (27:32) - Organizing AI Innovation (30:40) - Building an AI-Curious Culture (35:57) - AI's Impact on Creative Processes",
            "release_date": "2024-11-09",
            "duration_minutes": 37.01,
            "spotify_url": "https://open.spotify.com/episode/72notpAAvYfYMqYselPg22",
            "id": "72notpAAvYfYMqYselPg22"
        },
        {
            "title": "Ancient Rhetoric, Modern Innovation: Secrets from the Roman Empire to Silicon Valley | Creativity Boosters Episode 19",
            "description": "Discover how time-tested methods can enhance your communication and innovation strategies in today's fast-paced, data-driven world.  Explore the five canons of rhetoric—invention, arrangement, style, memory, and delivery—and learn how they can transform your presentations and ideas into compelling narratives that captivate and persuade.  Whether you're a manager, entrepreneur, or creative professional, this episode provides practical insights to help you harness the power of storytelling to engage your audience and drive innovation.  Join us as we unravel the secrets of persuasion and narrative building and let's boost your creativity together!  Time stamp (00:00) Intro (02:00) How often do you think about the Roman Empire?  (09:00) Cicero's Toolkit for Storytelling (19:25) Invention - Generating Ideas (21:20) Arrangement - Organizing Compelling Ideas (26:25) Style - Crafting Your Language (28:31) Memory - Mastering Your Content (30:20) Delivery - Modulating Your Voice Keeps Audience Captivated (33:10) Opening New Avenues for Creative Solutions",
            "release_date": "2024-10-10",
            "duration_minutes": 38.3,
            "spotify_url": "https://open.spotify.com/episode/4joW8ZOUyDxPsI8MAPRxjS",
            "id": "4joW8ZOUyDxPsI8MAPRxjS"
        },
        {
            "title": "From Pancakes to Processors: The Nvidia Story | Creativity Boosters Episode 18",
            "description": "Uncover the incredible journey of Nvidia, from its humble beginnings in a Denny's diner to becoming a global leader in AI and high-performance computing and gain insights in the fascinating story of Jensen Huang, the visionary behind Nvidia, and how his unique background and daring leadership propelled the company to new heights. Explore the serendipitous phone call that transformed their gaming GPUs into revolutionary tools for scientific research and the many lessons of adaptability, visionary leadership, and strategic pivots that can inspire you to foster innovation within your own teams and projects. Whether you're a senior manager, project leader, or analyst, this episode is packed with insights to help you navigate the complexities of creativity in the business world. Join us on this enlightening journey and let's boost your creativity together!  (00:00) Intro (05:37) Daringly reduce lead time by 75% (12:45) Inspiring an entire organization towards long term vision (16:06) Lessons for our listeners in their day to day lives (20:19) Pivoting greatly reduces time-to-insights (25:59) From 55% to 95% accuracy, Nvidia delivers AI breakthrough (31:22) Key lessons from Nvidia's innovation strategy (33:37) Cross departmental collaboration can lead to innovation opportunities (36:50) Key Takeaways",
            "release_date": "2024-07-07",
            "duration_minutes": 38.38,
            "spotify_url": "https://open.spotify.com/episode/6VCzE71Bs4XbEIVvUfzzW3",
            "id": "6VCzE71Bs4XbEIVvUfzzW3"
        },
        {
            "title": "From MBTI to Big Five: Understanding Personality's Influence on Innovation | Creativity Boosters Episode 17",
            "description": "Welcome back, Boosters! Are you ready to dive deep into the world of personality tests and their impact on creativity? Join us as we debunk the myths surrounding popular personality assessments like Myers-Briggs and DISC profiles, and explore the scientifically validated Big Five personality traits. Discover how personality influences creative potential and performance, and learn practical tips on how to shape your personality to boost creativity. We'll discuss the fascinating correlation between openness to new experiences and creative performance, and how you can intentionally change your personality traits to enhance your creative output. From understanding the role of neuroticism in creativity to exploring the importance of conscientiousness, extraversion, and agreeableness, this episode is packed with insights that will help you navigate the complexities of creativity in a business context. Join us on this enlightening journey and let's boost your creativity together!  Time stamp: (00:00) Intro (02:10) The Limitations of Popular Personality Tests (04:25) The Scientific Validity of the Big Five Personality Traits (06:45) The Role of Personality in Creativity (09:30) Understanding the Big Five Dimensions (12:00) The Impact of Openness to New Experiences (15:20) Can We Change Our Personality? (18:40) The Interplay of Personality Traits in Creativity (22:10) Practical Tips for Shaping Your Personality (25:30) The Importance of Mindfulness and Meditation (28:00) Engaging in New Experiences to Boost Creativity (30:15) The Role of Conscientiousness, Extraversion, and Agreeableness (33:20) Mitigating the Negative Impact of Neuroticism (36:10) Conclusion and Final Thoughts",
            "release_date": "2024-05-28",
            "duration_minutes": 40.13,
            "spotify_url": "https://open.spotify.com/episode/0C31gQtdWTIDD9OrHNjMjU",
            "id": "0C31gQtdWTIDD9OrHNjMjU"
        },
        {
            "title": "The Neuroscience of Creativity and Innovation | Creativity Boosters Episode 16",
            "description": "This episode is perfect for anyone who's ever been curious about hacking their brain to enhance creativity and innovation, or simply fascinated by the brain's workings during creative spurts.  Expect to delve into the cognitive processes of a product developer and grasp the complex dance of neurotransmitters during various stages of creative thought. Join the Boosters as they uncover the neuroscience of creativity and let's boost your creativity together.  Time stamp (00:00) Intro (03:10) Unusual Creative Brain Networks (04:15) Neurotransmitters related to creativity (11:05) Understanding Cognitive Creative Thinking (15:15) Using LLM Models for Assosciative Thinking (17:00) Time and Place for Associative and Convergent Thinking (18:50) DFN, Executive Network and the Salience Network (20:00) Meditation Increasing Activity in DFN (21:15) Alcohol and Caffeine's Effect on Creativity (24:30) Ben Affleck Judges Great Ideas (25:40) Does LSD Stimulate Your Creativity? (30:52) Cognitive Limitations to Creativity (37:52) Neurodivergence and Creativity (43:53) Neurotransmitters During the Creative Process (52:08) Achieving An Optimal Neurochemical State",
            "release_date": "2024-04-23",
            "duration_minutes": 60.93,
            "spotify_url": "https://open.spotify.com/episode/45MWXvpXClbaY7JNkALQX0",
            "id": "45MWXvpXClbaY7JNkALQX0"
        },
        {
            "title": "Shaping the Innovators of Tomorrow: An Interview with Christoffer Kølgaard | Creativity Boosters Episode 15",
            "description": "Welcome back, Boosters! Get ready to dive into the vibrant world of creativity in our latest episode. Join us as we uncover the fascinating traits that set creative children apart and explore the dynamic interplay between nature and nurture in fostering creativity. From the importance of openness to new experiences to the surprising role of neuroticism in fueling creativity, we'll delve into the complex landscape of creative development. Discover practical tips and strategies for parents to nurture their child's creative spirit and create an environment that fosters innovation and exploration. But wait, there's more! Recent studies from Africa challenge the notion that psychological safety is a prerequisite for creativity, sparking a discussion on the 'Goldilocks' amount of safety needed to cultivate creativity effectively. We'll also explore the critical role of self-efficacy in empowering individuals to embrace their creative potential. As we navigate the delicate balance between conformity and innovation, we'll uncover the secrets of problem-solving with curiosity and delve into the transformative power of embracing boredom as a catalyst for creativity. Plus, we'll debunk common myths about time pressure and procrastination, revealing the emotional hurdles that can hinder or unleash our creative potential. Join us on this enlightening journey and let's boost your creativity together!  Time stamp: (00:00) Intro (02:40) Defining creativity (04:45) Nurture vs Nature - Being born with creativity (07:30) Traits of Creative Children (10:25) Complex Relationship Between Neurotiscism and Creativity (12:30) The Role of Parents and a Safe Environment (13:50) The \"Goldilocks Zone of Safety for Creative Development\" (15:30) Self-Efficacy and Locus of Control  (17:20) The Impact of Education on Creative Expression (22:40) Norms vs. Novelty  (27:00) Stucture and Creative Freedom (33:30) Boredom as a Catalyst for Creativity (39:30) A Parenting Model For Nurturing Creative Minds (49:00) The Influence of Deadlines on Creativity  (51:00) Managing Procrastination (56:10) The Paradox of Choice (01:02:40) Identifying Creative Children (01:10:30) A Rule-based approach to Creativity (01:15:00) The Relationships between Curiosity and Creativity",
            "release_date": "2024-03-21",
            "duration_minutes": 79.94,
            "spotify_url": "https://open.spotify.com/episode/1qLdkwcsWe7dk0tHQbX8Tw",
            "id": "1qLdkwcsWe7dk0tHQbX8Tw"
        },
        {
            "title": "Managing Brands and Driving Innovation in a Creative Industry: An Interview with Simran G. Jaiswal | Creativity Boosters Episode 14",
            "description": "Welcome back Boosters! We are graced with Simran Jaiswal's presence and insights in today's episode.  Our 4-part series on the Creative Problem Solving Journey has had us journey across many treacherous waters, but we've found safe path in the seas of Problem Clarification, Ideation, Maturation and lastly Implementation. These methods and frameworks, however, are established for people who find themselves traversing the hallways of corporate life. Our curiosity naturally knows no limits, so we had to reach out to Simran Jaiswal who is brand manager, label head and leading creative efforts for many artists and brands interacting with Universal Music Group in India.  Simran is at the intersection of creative and corporate life and she helps us shine a light on how creativity and innovation looks like in that context. Tune in and let's boost your creativity together!  Time stamp (00:00) Intro (02:55) Creativity as a 6th Sense (03:45) The Role of Mood in Creativity (05:10) Creating a Jolly Mood for Creativity (07:42) Using Dreaming as A Creative Tool (08:30) Influence of Artistic Heritage On Business and Creativity (09:40) Becoming a Marketer and The Role of Creativity (10:55) Creativity in Marketing and Design (12:25) The Importance of Authenticity in Branding (14:18) Collaboration in Marketing Projects (18:40) Balancing Creativity and Deadlines (20:00) Debunking Myths in Branding Strategy (21:50) The Constant Process of Brand Strategy (22:40) Creating Content the Converts in 3-5 Seconds  (25:20) Brands Collaborating with Artists  (27:35) Gen Z Are Ruining Movies (29:00) Thumb-Sized Buttons: Using Insights to Modify Creative Products (31:45) Finding Inspiration and Creativity In a Cup of Coffee (34:35) Creating a Creative Process (36:55) Challenges in Idea Execution (39:53) The Role of AI in Creativity (42:40) Trends and Developments in Brand Strategy (45:45) Minimalism as a Brand's Cornerstone (47:55) The Shape Circle as an Innovative Solution (50:25) Convincing Others of Your Creative Vision",
            "release_date": "2024-03-12",
            "duration_minutes": 52.23,
            "spotify_url": "https://open.spotify.com/episode/7zEa69My06hlVEujlFPWcM",
            "id": "7zEa69My06hlVEujlFPWcM"
        },
        {
            "title": "A Journey into Creative Problem Solving: Mastering Idea Implementation | Creativity Boosters Episode 13",
            "description": "Embark on the next chapter of \"The Journey of Creative Problem Solving\" with Creativity Boosters! In this episode, we unravel the intricacies of Implementation, the pivotal phase that breathes life into innovation. We kick off this episode by exploring the distinctive traits of the Soccer Coach, Engineer, Nurse, and Entrepreneur personality traits and how personality types should impact your communication and collaboration. We unravel the art of involving different personality types at various stages in the implementation process, fostering a harmonious journey from conception to realization. This episode will leave you well versed in the realm of Change Management, where we'll guide you through preparing for change, managing the change process, and reinforcing the change to ensure seamless integration. The episode culminates with a reflection on the invaluable lessons learned throughout our 4-part Journey of Creative Problem-Solving.  Tune in and let's boost your creativity together.",
            "release_date": "2024-01-16",
            "duration_minutes": 41.73,
            "spotify_url": "https://open.spotify.com/episode/36V6DDDV6flIY10zGDwGPn",
            "id": "36V6DDDV6flIY10zGDwGPn"
        },
        {
            "title": "A Journey into Creative Problem Solving: Mastering Idea Maturation | Creativity Boosters Episode 12",
            "description": "Welcome back to Creativity Boosters! In this next installment of \"The Journey of Creative Problem Solving,\" we advance beyond idea clarification and ideation to delve into the crucial phase of idea maturation. Building upon our previous episodes, where we navigated through the initial stages of idea clarification and the exploration of potential solutions, we now explore techniques and frameworks to develop and refine the generated ideas. We kick off by exploring an \"outside-in\" approach to ideation, focusing on a user-centered methodology for developing solutions that resonate with users' needs. You can expect to uncover the power of prototyping as a method to mature ideas, illustrated by Dyson's iterative process of over 5000 attempts for a specific solution and gain insights into the nuances between prototyping and Minimum Viable Products (MVPs). You will learn how to effectively select ideas for maturation, considering parameters such as desirability, feasibility, viability - and maybe loveability?  Delve deeper into the importance of desirability as a crucial parameter in idea selection. Join us as we connect the dots between idea clarification, ideation the critical phase of idea maturation. Listen closely to become empowered during this phase of your Creative Problem Solving Journey and let's boost your creativity together!  Time stamp (00:00) Intro (02:45) Outside-In Approach to Ideation (04:30) User-Centered Approach to Developing Solutions  (06:45) Prototyping Mature Ideas & Bedtime Story Brilliance (16:55) Prototyping vs. Minimum Viable Products (26:30) Selecting Ideas: Parameters for Success (30:30) Is Desirability the Most Important Factor? (33:05) More Bedtime Stories  (37:50) The Value of Pilot-testing and Feedback Loops (40:30) The Cost of Idea Maturation (43:20) What is Structural Failure in your Processes? (44:40) Creativity Jam (47:15) Closing Remarks",
            "release_date": "2023-12-01",
            "duration_minutes": 50.08,
            "spotify_url": "https://open.spotify.com/episode/14uZykClIUPE8rJ9dc5l2K",
            "id": "14uZykClIUPE8rJ9dc5l2K"
        },
        {
            "title": "A Journey into Creative Problem Solving: Mastering Ideation | Creativity Boosters Episode 11",
            "description": "Welcome to another episode of Creativity Boosters! In this enlightening episode, we delve deep into the art of ideation and uncover the secrets to facilitating workshops that spark a multitude of high-quality ideas. We kick off with a fun analogy, inviting you to imagine yourself as a kangaroo to introduce the concept of heuristics to set the stage for creative thinking and you will soon after discover why ideation is crucial for generating, developing, and effectively communicating groundbreaking business ideas.  Expect also to learn the critical instances when ideation may not be suitable as well as learning how to apply unconventional sources for ideas like the \"Get Fired\"-technique. Join us on this journey to unlock your creative potential and learn practical workshop techniques for ideation that lead to innovative solutions. Tune in to Creativity Boosters and let's boost your creativity together!  Time stamps (00:00) - The Kangaroo Heuristic (06:00) - Generating Groundbreaking Ideas (09:50) - Failures of Ideation: The Dance of Change Management (12:10) - Monkey vs. Suit: Decoding System 1 vs. System 2 Thinking (15:30) - Creating the Environment for Ideation Success (18:10) - Out-of-the-Box Ideas: Unlikely Sources, Unexpected Results (20:50) - Exploring the Many Forms of Ideation (22:30) - Knowing When Not to Ideate (25:50) - Fresh Perspectives: Non-Experts in the Ideation Mix (29:20) - Ground Rules for Ideation (31:00) - SCAMPER Unveiled: Transforming Existing Products and Services (39:00) - Elon Musk's Rocket Ride: Innovating with Cost Efficiency (46:40) - Challenging Assumptions to Craft Original Ideas (52:00) - Host Favorites: Techniques for Effective Implementation (54:30) - Picking the Pearls: Selecting Top-Notch Ideas (58:50) - Essentials of Ideation",
            "release_date": "2023-11-19",
            "duration_minutes": 63.5,
            "spotify_url": "https://open.spotify.com/episode/3amHZnPlVmUQtLJfcJCOOU",
            "id": "3amHZnPlVmUQtLJfcJCOOU"
        },
        {
            "title": "A Journey into Creative Problem Solving: Mastering Problem Clarification | Creativity Boosters Episode 10",
            "description": "Welcome to another insightful episode of Creativity Boosters! In this episode, we dive deep into the world of creative problem solving and explore the incredible power of asking one simple question: \"Why?\" We begin by breaking down the four key stages of creative problem solving: Clarify, Ideation, Develop, and Implementation. Each stage is a crucial part of transforming challenges into innovative solutions. We also share a surprising story about elevators and the unexpected lessons they teach us about perceiving and tackling problems and why expanding the solution space is essential for finding the right answers that resonate with the right people. Additionally, we explore the concept of setting direction based on hypotheses rather than rushing to solutions and how this shift can lead to more impactful outcomes. And by the end, we will make you consider whether you need to change your approach or simply add \"lubricant\" to your current one. This question will highlight the importance of evaluating the root of the problem. Join us on this enlightening journey as we uncover the nuances of creative problem solving and problem understanding. Tune in to Creativity Boosters, and let's boost your creativity together!   Time stamps (00:00) - Unlocking the Secrets of Creative Problem Solving (00:58) - The 'Why' Factor: Your Key to Unleashing Innovation (02:28) - Finding Solutions Tailored to the Right People (03:05) - The Power of 'Why': A Game-Changer for Problem Solvers (04:25) - Elevator Insights: Surprising Lessons in Problem Solving (08:05) - Redefining Problem Solving: Think Beyond the Obvious (15:38) - The Hidden Layers of Problems: What Lies Beneath? (22:20) - The Perils of Unresolved Disagreements on Problems (27:50) - Cracking the Code: Understanding the Local Context (29:20) - Hypotheses vs. Solutions: Shaping the Right Direction (30:50) - Lubricant or Transformation: What Does the Problem Demand? (33:00) - From Ideas to Impact: Developing Solutions That Matter (36:50) - Reframing for Success: Seven Practices to Try (48:40) - Mastering the Art of Effective Reframing: Key Takeaways (51:40) Creativity Jam (54:20) Choosing the Best Problem Solving Framework",
            "release_date": "2023-09-30",
            "duration_minutes": 55.96,
            "spotify_url": "https://open.spotify.com/episode/3o9lDs6gSaBi4zPPdLHYnv",
            "id": "3o9lDs6gSaBi4zPPdLHYnv"
        },
        {
            "title": "Startup Survival Guide: Insights from Søren Nielsen, Author of 'Death By Innovation Theater' | Creativity Boosters Episode 9",
            "description": "Welcome to another episode of Creativity Boosters! In this exciting episode, we dive into the world of startups and innovation with a special guest, Søren Nielsen, the author of the book \"Death By Innovation Theater.\" Join us as we uncover the truths behind innovation theater and discover valuable insights for startup survival. Søren Nielsen, former CEO and co-founder of the startup ERNIT, shares his firsthand experience of how innovation theater can be detrimental to young companies. Through his captivating storytelling, he reveals important lessons learned from his entrepreneurial journey and offers practical advice on how other startups (and even corporates) can avoid the perils of innovation theater. During our conversation, we explore the concept of innovation theater and its damaging effects on startups, discussing why it often becomes more about showcasing than achieving tangible results. Søren Nielsen's unique perspective sheds light on the dangers of partnering with corporates and the need for genuine innovation within the startup ecosystem. Join us as we uncover the secrets of startup survival, learn how to navigate the challenges of innovation theater, and gain practical strategies to build sustainable businesses. Tune in to Creativity Boosters, and let's boost your creativity together!  Note: To learn more about Søren Nielsen and his extensive work in the startup and entrepreneurship space, be sure to check out his LinkedIn profile at [https://www.linkedin.com/in/s%C3%B8ren-nielsen-7134a35/].  Time stamp (00:00) Intro (02:16) Welcome to Søren! (04:00) Are you \"doing\" or just talking about doing? (05:10) Implementation above all else  (07:15) Shoelaces are fundamental for innovation (10:00) Balancing risk and rewards (11:45) Don't fall in love with technology (16:30) Vanity metrics don't push your solution forward (19:25) How did media attention affect ERNIT? (23:00) Polishing a rock thinking it's a diamond (24:40) Releasing-to-production too early in organizations  (26:11) How do you push aside your ego and truly listen to the market? (28:23)  Wisdom from mistakes (30:26) Why are innovation labs pushed outside the organizations? (32:25) Is the goal of innovation to integrate or for branding? (33:49) The real metrics to measure innovation (38:31) Innovation as a numbers game (41:14) Moving quickly past an organization's internal processes (45:06) Learn to hack production data  (46:35) Collaborating with startups (49:36) Creativity Jam (54:08) Your credit card is magical (01:05:20) Startup-Corporate Collaborations (01:07:35) Funding and revenue streams  (01:12:47) Watch out for these red flags in your organization (01:14:51) Most Creative Invention (01:19:06) Key takeaways",
            "release_date": "2023-06-10",
            "duration_minutes": 81.28,
            "spotify_url": "https://open.spotify.com/episode/3FsFwLm7G2OpVA8JYODDBq",
            "id": "3FsFwLm7G2OpVA8JYODDBq"
        },
        {
            "title": "From 'Fuck Up Nights' to Future Innovations: A conversation with Jasmina Pless, Head of Entrepreneurship at Danish Chamber of Commerce | Creativity Boosters Episode 8",
            "description": "Welcome to Episode 8 of Creativity Boosters! In this exciting episode, we have the privilege of interviewing Jasmina Pless, the Head of Entrepreneurship at the Danish Chamber of Commerce. Join us as we delve into the world of innovation in Denmark and explore the strategies and initiatives that drive success. We also pick Jasmina's brain on how we can make Denmark even more innovative and create a nurturing ecosystem for high-growth companies to flourish. We discuss strategies to retain these companies within the country, ensuring long-term economic growth and competitiveness. Join us for this captivating conversation as we uncover the path to future innovations in Denmark. Tune in to Creativity Boosters, and let's together explore the secrets behind driving innovation and building a thriving entrepreneurial landscape. Get ready to be inspired! Note: To learn more about Jasmina Pless and her extensive work in the startup and entrepreneurship space, be sure to check out her LinkedIn profile at [https://www.linkedin.com/in/jasminapless/].  Time stamp (00:00) Intro  (02:46) What does Danish Chamber of Commerce do? (06:33) Most critical competencies to succeed (10:30) Value of role models (18:12) How do people talk about failures in startups? (21:45) Fuck up Nights (22:55) How is Denmark ranked on innovation and entrepreneurship? (25:40) Value of startup-corporate partnerships (30:15) Denmark doesn't foster high-growth companies (33:30) Scaling companies in Denmark (36:35) Are we good at growing talents in the EU? Love keeps talents in the country (38:45) Incentive for corporations to work with startups (43:10) Embracing failures and other inspiring startups processes  (46:00) Embracing failures within your own context (46:30) No one got fired for buying an IBM omputer (48:30) Seeing problems others can't (diversity) (50:45) Do investors consider diversity? (55:08) How to prioritize which startup to fund? (1:00:50) Making Denmark more innovative  (1:04:40) Difference between a startup and a newly established company? Low and High productivity (1:08:40) Most creative startup you've seen (1:11:08) Keeping unicorns in Denmark (1:13:15) How do you define innovation and creativity?  (1:18:12) Creativity Jam  (1:21:38) What is the most creative invention of all mankind? (1:22:55) Key takeaways",
            "release_date": "2023-05-27",
            "duration_minutes": 86.01,
            "spotify_url": "https://open.spotify.com/episode/5U8o7YzJlKjJ90rnCmaPmF",
            "id": "5U8o7YzJlKjJ90rnCmaPmF"
        },
        {
            "title": "The Power of Storytelling: How to Boost Your Business Creativity and Persuasion | Creativity Boosters Episode 7",
            "description": "Welcome to the latest episode of Creativity Boosters, where we explore the intersection of creativity and business. In this episode, we will discuss the art of storytelling and how it can impact employees' ability to drive innovation within their organizations. In this episode Dinko & Nikhil explore how storytelling can enhance persuasive skills, help develop innovative ideas, and create a sense of unity among team members. Join us as we delve into questions such as: What makes storytelling such a powerful tool for business creativity? How can metaphors help employees connect with stakeholders and inspire innovative thinking? And how can storytelling help middle managers and young professionals drive an innovation agenda in their organizations? Tune in to Creativity Boosters, and let's boost your creativity together!  Time stamp (00:00) Intro  (01:00) Sharing ideas through storytelling (02:55) Why should people follow your ideas? (06:53) Why stories are so powerful? (13:45) Even great ideas need persuaders (17:34) Amazon using press releases to promote new ideas (20:24) Bringing Johnny to the meeting (24:20) Middle managers gathering teams around a shared goal (26:05) Metaphors & Pokémons (28:45) Employees are storyhunters (32:40) Creativity Jam",
            "release_date": "2023-04-04",
            "duration_minutes": 41.97,
            "spotify_url": "https://open.spotify.com/episode/5WektDIIsx6Cx8PbJCQgfD",
            "id": "5WektDIIsx6Cx8PbJCQgfD"
        },
        {
            "title": "AI-Powered Creativity: Leveraging ChatGPT to Drive Innovation | Creativity Boosters Episode 6",
            "description": "Welcome to another episode of Creativity Boosters! In this episode, Dinko and Nikhil will be discussing how technology, and in particular ChatGPT, are affecting employees' ability to apply business creativity and drive innovation within their organizations. We will explore questions such as: How does technology impact the creative process in the workplace? How can ChatGPT and other AI-powered tools be used to enhance creativity? And what are the challenges that companies face when integrating technology into their creative processes? Then we'll share our experiences and offer practical advice on how to leverage technology to drive business creativity and innovation. We will also delve into the potential risks of relying too heavily on technology, and the importance of finding a balance between technological advancements and human creativity. Join us as we explore the intersection of technology and business creativity, and learn how to harness the power of technology to drive innovation in your organization. Tune in to Creativity Boosters, and let's boost your creativity together!   (00:00) - Intro  (01:15) - Which jobs is  AI coming to take over? (05.30) - What is ChatGPT? (11:28) - Does technology hinder business creativity? (12:10) - ChatGPT beats us in a creativity jam? (15:26) - Understanding your problem before Googleing (17:20) - Are hard skills being replaced by prompters? (20:10) - Is ChatGPT becoming a disruptor for Google? (23:50) - What if Germany won WWII? (27:04) - Bringing back the dead (31:28) - How can we use tools to become more innovative? (37:38) - Learning from mistakes to foster more creativity (39:10) - How should a manager use ChatGPT? (40:43) - How should an employee use it ChatGPT? (43:50) - Takeaways (45:45) - Creativity Jam",
            "release_date": "2023-03-28",
            "duration_minutes": 52.03,
            "spotify_url": "https://open.spotify.com/episode/3QNKsKkteCNQHfxFurWrXD",
            "id": "3QNKsKkteCNQHfxFurWrXD"
        },
        {
            "title": "Recruiting Innovative Candidates: Insights from a VP at Novo Nordisk | Creativity Boosters Episode 5",
            "description": "In this episode, we are joined by Alain Proietti, Vice President of Global Talent Acquisition, Diversity and Inclusion at Novo Nordisk, one of the world's leading pharmaceutical companies. We will be discussing how to recruit innovative candidates, and the challenges and opportunities that come with fostering creativity within an organization. Our guest will share their insights on how Novo Nordisk attracts and retains top talent, and how they support creativity and innovation within the company. We will also delve into the concept of organizational slack, and how having the right resources and support systems in place can help employees take on new challenges and push the boundaries of what is possible. Join us as we explore these topics and more, and learn how to build a more creative and innovative workforce. Tune in to Creativity Boosters, and let's boost your organization's creativity together.  Time stamps: (00:00) - Introducing Alain Proietti (01:49) - Defining Talent Aquistion (02:44) - Becoming attractive to the candidates you want before the need for them arises (05:28) - Defining Business Creativity (08:00) - Impact of CEOs telling us to be more innovative (12:43) - How do you know that you have become an innovative organization (15:33) - Can divergent thinkers be accepted in structured organizations (18:45) - Actions to increase inclusion of creative candidates (23:06) - Evaluating if a candidate is creative (27:00) - Recruiting creative talents for an uncreative organization (31:29) - Three learnings an organization can apply to successfully aquire and onboard creative talents (33:54) - Organizational slack (37:00) - Most creative invention  (39:09) - Creativity Jam",
            "release_date": "2022-12-12",
            "duration_minutes": 44.05,
            "spotify_url": "https://open.spotify.com/episode/08agkNtG6aHn1I3K0m2Eec",
            "id": "08agkNtG6aHn1I3K0m2Eec"
        },
        {
            "title": "The Competitive Advantage of Creativity: Insights from Google and Beyond | Creativity Boosters Episode 4",
            "description": "In this episode of Creativity Boosters, Dinko and Nikhil explore the role of creativity in driving innovation in organizations. They begin by discussing the importance of attracting and retaining creative talent, and the benefits it can bring to an organization. The hosts then turn their attention to real-life examples from companies like Google, and discuss the various strategies and practices these companies have implemented to recruit *smart creatives*. Next, the hosts discuss how to identify and evaluate creative job candidates according to academia. They delve into the various theories and models of creativity, and how they can be applied in the hiring process to identify individuals who are adept at business creativity.  In conclusion, the hosts discuss the potential benefits of creativity as a competitive advantage, and how organizations can use it to drive innovation and growth in the modern business landscape. Tune in to Creativity Boosters, and let's boost your organization's creativity together.   Time stamps: (00:00) - Creativity as a competitive advantage (09:00) - Link between being late and being creative  (11:00) - Are you a procrastinator or are you just reflecting on non linear solutions to the task at hand  (12:00) - Questions to identify a creative candidate (15:00) - Benefit of having creative candidates  (19:57) - Being bold enough to try new things  (21:52) - Creative traits to look for in candidates  (22:45) - How do to measure business creativity through tests  (23:36) - Creative traits according to academia  (39:19) - 6 indicators of creativity - testing for creativity",
            "release_date": "2022-12-09",
            "duration_minutes": 74.05,
            "spotify_url": "https://open.spotify.com/episode/2ztWf04rqnD7DgId7OoJzK",
            "id": "2ztWf04rqnD7DgId7OoJzK"
        },
        {
            "title": "How to become more creative w/Christan Byrge Ph.d. | Creativity Boosters Episode 3",
            "description": "In this episode we sit down with renowned professor Christan Byrge and ask him any and everything regarding innovation, creativity and if some animals are more creative than others. Key takeaways include: - Value of taking \"low cognitive pauses\" - Creative confidence is key to develop innovative solutions - Windows of opportunity... the magical place where ideas are shared - The competences you need to become more creative  Enjoy!",
            "release_date": "2022-09-27",
            "duration_minutes": 95.79,
            "spotify_url": "https://open.spotify.com/episode/5kV1R2oUryMz3p8i7NKY1q",
            "id": "5kV1R2oUryMz3p8i7NKY1q"
        },
        {
            "title": "What does successful innovation look like in Olympic disciplines and Le Mans? | Creativity Boosters Episode 2",
            "description": "In this episode expect to learn how innovation has fuelled (pun very much intended) the sport of Le Mans, which attributes are necessary for athletes and for high performers in your organization to jump higher and present ideas that stick the landing.  We also dive into the different innovation approaches and what that means for your approach in the next company brainstorming session.",
            "release_date": "2022-09-26",
            "duration_minutes": 41.27,
            "spotify_url": "https://open.spotify.com/episode/5HF7yk1UsxP3YQIvZKKyyj",
            "id": "5HF7yk1UsxP3YQIvZKKyyj"
        },
        {
            "title": "Do you know how the airplane industry has helped every single parent worldwide in their daily life?| Creativity Boosters Episode 1",
            "description": "In the episode, our Creativity Boosters dive deep into what baby strollers and airplane design can tell us about innovation.   They offer some practical advice on how to implement \"idea combination\" as a fixed element in all your innovation sprints.  And most importantly, you get to learn who the Creativity Boosters really are.  So exciting!",
            "release_date": "2022-09-26",
            "duration_minutes": 21.33,
            "spotify_url": "https://open.spotify.com/episode/7gmcxtWN3CBWPYPTSICZD4",
            "id": "7gmcxtWN3CBWPYPTSICZD4"
        }
    ]
}